ХМНПФ_Общее/Documents/уп_РегистрацияСмертиУчастников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_РегистрацияСмертиУчастников</Name>
		</Properties>
	</Document>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_ПенсионныеПравила.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ПенсионныеПравила</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Правопреемники</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормироватьПроводкиСводно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПредоставлятьСоциальныйВычет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВсегдаНачислятьЗаПолныйПериод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РассчитыватьОУДПриЗачислении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормироватьПроводкиСводноОПС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВестиРезервВыплатОПСПоДоговорам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВестиРезервВыплатОПСПоТипамСумм</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СписыватьТипыСуммПропорционально</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НДФЛПравопреемниковОПС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КонтрольНомеровДоговоровОПСГод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Корректировать51СчетПоВидамДеятельности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеСклонятьФИОВДокументах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РасчетИДОПСпоПриказуФСФР</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеСписыватьИДРасторженцевОПСПриНачислении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СчетНачисленияИДПриЗакрытии</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОпределениеКоличестваВыплат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПечататьФИОВЗаявлениях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвращатьСредстваУмершихДоВступленияВДействие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МетодРасчетаРазмещенногоПРДляДекларации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КонтрольНумерацииДоговоров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/AccumulationRegisters/уп_ВозвратыПенсийНПО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ВозвратыПенсийНПО</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НалоговаяБазаПоНДФЛ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументВыплаты</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уп_ВыплатныеРеестры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Схема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСхемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидДвиженияРегистра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ВидыДвиженияВозвратов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипПенсии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыПенсионныхСхем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НачПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КонПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипРезерва</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыРезерва</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипСуммы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ТипыСумм</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ХМНПФ_Общее/AccumulationRegisters/уп_ВозвратыПрочихНачисленийНПО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ВозвратыПрочихНачисленийНПО</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НалоговаяБазаПоНДФЛ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипВыплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыВыплат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипРезерва</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыРезерва</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипСуммы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ТипыСумм</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ХМНПФ_Общее/AccumulationRegisters/уп_ОтвергнутыеПлатежиПенсийНПО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ОтвергнутыеПлатежиПенсийНПО</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НДФЛ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НалоговаяБазаПоНДФЛ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НачПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КонПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипРезерва</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыРезерва</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипСуммы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ТипыСумм</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ХМНПФ_Общее/Documents/уп_РегистрацияСмертиУчастников/Ext/ObjectModule.bsl
&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура ХМОбработкаПроведения(Отказ, Режим)

	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначенияБПВызовСервера.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Проверка ручной корректировки
	Если уп_ОсновнаяПоставкаСервер.РучнаяКорректировкаОбработкаПроведения(РучнаяКорректировка,Отказ,Заголовок,ЭтотОбъект,Ложь) Тогда
		Возврат
	КонецЕсли;
	
	ИспользуетсяМодульПДС = РегистрыСведений.уп_ИспользованиеМодулейУНПФ.ПолучитьПоследнее(Дата,Новый Структура("Организация,Модуль",Организация,"ПДС")).Используется;	
	
	ДоступенНПО = РольДоступна("ПолныеПрава") ИЛИ РольДоступна("уп_СпециалистНПО") ИЛИ РольДоступна("уп_ЧтениеНПО");	
	ДоступенПДС = ?(ИспользуетсяМодульПДС,РольДоступна("ПолныеПрава") ИЛИ РольДоступна("пдс_СпециалистПДС") ИЛИ РольДоступна("пдс_ЧтениеПДС"),Ложь);	
	ПенсионныеПравила = РегистрыСведений.уп_ПенсионныеПравила.ПолучитьПоследнее(Дата, Новый Структура("Организация", Организация));
	
	МассивСообщений = Новый СписокЗначений;

	//проверяем, чтобы тип суммы и тип резерва были заполнены
	Для каждого стр из ВозвратыОтвергнутыеПлатежи Цикл
		Если НЕ ЗначениеЗаполнено(стр.ТипСуммы) Тогда
			Отказ = Истина;
			уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("По счету №"+стр.НомерСчета+" не выбран тип суммы для списания возврата и/или отвергнутого платежа.",,Заголовок);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(стр.ТипРезерва) Тогда
			Отказ = Истина;
			уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("По счету №"+стр.НомерСчета+" не выбран тип резерва для списания возврата и/или отвергнутого платежа.",,Заголовок);
		КонецЕсли;
	КонецЦикла;	
	

	//Прописываем дату смерти в физлица
	ФИЗОбъект = Участник.уп_ФизЛицо.ПолучитьОбъект(); 
	Если ЗначениеЗаполнено(ДатаСмерти) Тогда
		ФИЗОбъект.уп_ДатаСмерти = ДатаСмерти; 
	Иначе
		ФИЗОбъект.уп_ДатаСмерти = Дата;
	Конецесли;	
	ФИЗОбъект.Записать();  
	
	Движение = Движения.уп_ИсторияРегистрацииДатыСмерти.Добавить();
	Движение.Период = Дата;
	Движение.Участник = Участник;
	Движение.ИсточникИнформации = ИсточникИнформации;
	Если ЗначениеЗаполнено(ДатаСмерти) Тогда
		Движение.ДатаСмертиПоРегистратору = ДатаСмерти;
		Движение.ДатаСмертиВСправочнике = ДатаСмерти;
	Иначе
		Движение.ДатаСмертиВСправочнике = Дата;
	КонецЕсли;	
	
	Если ДоступенНПО Тогда
		
		Движения.уп_ВозвратыПенсийНПО.Записать();
		Движения.уп_ВозвратыПрочихНачисленийНПО.Записать();
		Движения.уп_ОтвергнутыеПлатежиПенсийНПО.Записать();
		Движения.уп_ОтвергнутыеПлатежиПрочиеНачисленияНПО.Записать();
		Движения.уп_НачисленияПенсий.Записать();
		Движения.уп_ПрочиеНачисления.Записать();
		
		Для Каждого ТекСтрокаСписокСчетов Из СписокСчетов Цикл
			// регистр СостоянияПС 
			//если текущее состояние накопительный период, то подготовка к закрытию
			//если текущее состояние выплатной период, то выплаты приостановлены
			// в любом ином случае состояние мегять не надо
			ТекСостояние = РегистрыСведений.уп_СостоянияПС.ПолучитьПоследнее(Дата,Новый Структура("НомерСчета", ТекСтрокаСписокСчетов.НомерСчета)).Состояние;
			ТекСхема = РегистрыСведений.уп_СхемаСчета.ПолучитьПоследнее(Дата,Новый Структура("НомерСчета", ТекСтрокаСписокСчетов.НомерСчета)).Схема;
			КорректироватьСостояние = Ложь;
			ДоговорЗакрыт = Ложь;
			АктуальноеСостояние = ПолучитьАктуальноеСостояниеПС(Новый Структура("НомерСчета", ТекСтрокаСписокСчетов.НомерСчета)); 
			ПСЗакрыт = Ложь;
			Если АктуальноеСостояние <> Неопределено Тогда
				Если (АктуальноеСостояние.Состояние <> Перечисления.уп_СостоянияПС.ПодготовкаКЗакрытию) 
					ИЛИ (АктуальноеСостояние.Состояние <> Перечисления.уп_СостоянияПС.Закрыт) Тогда
					Если АктуальноеСостояние.Период > Дата И АктуальноеСостояние.Регистратор.Дата < Дата Тогда
						КорректироватьСостояние = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			Если ТекСостояние = Перечисления.уп_СостоянияПС.НакопительныйПериод Тогда
				Движение = Движения.уп_СостоянияПС.Добавить();
				Движение.Период = Дата;
				Движение.НомерСчета = ТекСтрокаСписокСчетов.НомерСчета;
				Движение.Расшифровка = Перечисления.уп_РасшифровкаСостоянийПС.ПоСмерти;
#Вставка
//https://redmine.npf.com/issues/4268
				Если ИСТИНА Тогда
#КонецВставки
#Удаление
				Если ТекСхема.НаследованиеВНакопительныйПериод Тогда
#КонецУдаления
					Движение.Состояние = Перечисления.уп_СостоянияПС.ПодготовкаКЗакрытию;
				Иначе
					Движение.Состояние = Перечисления.уп_СостоянияПС.Закрыт;
					ПСЗакрыт = Истина;
					//если договор с физиком в свою пользу, то его надо закрыть
					Если ТекСтрокаСписокСчетов.ПенсионныйДоговор.Вкладчик = Участник Тогда
						Движение = Движения.уп_СостоянияДоговора.Добавить();
						Движение.Период = Дата;
						Движение.Состояние = Перечисления.уп_СостоянияДоговора.Закрыт;
						Движение.ПенсионныйДоговор = ТекСтрокаСписокСчетов.НомерСчета.Владелец;
						
						
						ПД = ТекСтрокаСписокСчетов.НомерСчета.Владелец.ПолучитьОбъект();
						ПД.ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияПС.ПоСмерти;
						ПД.Записать();
						
						ДоговорЗакрыт = Истина;
					КонецЕсли;
				КонецЕсли;
				
				Если КорректироватьСостояние Тогда
					Движение = Движения.уп_СостоянияПС.Добавить();
					Движение.Период = АктуальноеСостояние.Период+1;
					Движение.НомерСчета = ТекСтрокаСписокСчетов.НомерСчета;
					Движение.Расшифровка = Перечисления.уп_РасшифровкаСостоянийПС.ПоСмерти;
#Вставка
//https://redmine.npf.com/issues/4268
					Если ИСТИНА Тогда
#КонецВставки
#Удаление
					Если ТекСхема.НаследованиеВНакопительныйПериод Тогда
#КонецУдаления
						Движение.Состояние = Перечисления.уп_СостоянияПС.ПодготовкаКЗакрытию;
					Иначе
						Движение.Состояние = Перечисления.уп_СостоянияПС.Закрыт; 
						ПСЗакрыт = Истина;
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли Тексостояние = Перечисления.уп_СостоянияПС.ВыплатнойПериод 
				ИЛИ Тексостояние = Перечисления.уп_СостоянияПС.НачисленияПриостановлены
				ИЛИ Тексостояние = Перечисления.уп_СостоянияПС.ВыплатыПриостановлены Тогда
				Движение = Движения.уп_СостоянияПС.Добавить();
				Движение.Период = Дата;
				Движение.НомерСчета = ТекСтрокаСписокСчетов.НомерСчета;
				Движение.Расшифровка = Перечисления.уп_РасшифровкаСостоянийПС.ПоСмерти;
#Вставка
//https://redmine.npf.com/issues/4268
				Если ИСТИНА Тогда
#КонецВставки
#Удаление
				Если ТекСхема.НаследованиеВВыплатнойПериод Тогда
#КонецУдаления
					Движение.Состояние = Перечисления.уп_СостоянияПС.ПодготовкаКЗакрытию;
				Иначе
					Движение.Состояние = Перечисления.уп_СостоянияПС.Закрыт;
					ПСЗакрыт = Истина;
					//если договор с физиком в свою пользу, то его надо закрыть
					Если ТекСтрокаСписокСчетов.ПенсионныйДоговор.Вкладчик = Участник Тогда
						Движение = Движения.уп_СостоянияДоговора.Добавить();
						Движение.Период = Дата;
						Движение.Состояние = Перечисления.уп_СостоянияДоговора.Закрыт;
						Движение.ПенсионныйДоговор = ТекСтрокаСписокСчетов.НомерСчета.Владелец;
						
						
						ПД = ТекСтрокаСписокСчетов.НомерСчета.Владелец.ПолучитьОбъект();
						ПД.ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияПС.ПоСмерти;
						ПД.Записать();
						
						ДоговорЗакрыт = Истина;
					КонецЕсли;
				КонецЕсли;
				Если КорректироватьСостояние Тогда
					Движение = Движения.уп_СостоянияПС.Добавить();
					Движение.Период = АктуальноеСостояние.Период+1;
					Движение.НомерСчета = ТекСтрокаСписокСчетов.НомерСчета;
					Движение.Расшифровка = Перечисления.уп_РасшифровкаСостоянийПС.ПоСмерти;
#Вставка
//https://redmine.npf.com/issues/4268
					Если ИСТИНА Тогда
#КонецВставки
#Удаление
					Если ТекСхема.НаследованиеВНакопительныйПериод Тогда
#КонецУдаления
						Движение.Состояние = Перечисления.уп_СостоянияПС.ПодготовкаКЗакрытию;
					Иначе
						Движение.Состояние = Перечисления.уп_СостоянияПС.Закрыт;
						ПСЗакрыт = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			Если ЗначениеЗаполнено(ДокументРегистрации) Тогда
				//Если ДокументРегистрации.Вид = Справочники.уп_ВидыДокументовРегистрации.СвидетельствоОСмерти 
				Если ТекСтрокаСписокСчетов.ПенсионныйДоговор.Вкладчик = Участник 
					и НЕ ДоговорЗакрыт Тогда
					Движение = Движения.уп_СостоянияДоговора.Добавить();
					Движение.Период = Дата;
					Движение.Состояние = Перечисления.уп_СостоянияДоговора.Закрыт;
					Движение.ПенсионныйДоговор = ТекСтрокаСписокСчетов.НомерСчета.Владелец;
					
					
					ПД = ТекСтрокаСписокСчетов.НомерСчета.Владелец.ПолучитьОбъект();
					ПД.ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияПС.ПоСмерти;
					ПД.Записать();
				КонецЕсли;	
			КонецЕсли;
			
			Если ПСЗакрыт Тогда
				ДатаПоследнейФиксации = РегистрыСведений.уп_ДатаФиксацииОбязательствНПО.ПолучитьПоследнее(Дата-1, Новый Структура("НомерСчета", ТекСтрокаСписокСчетов.НомерСчета));
				Если ЗначениеЗаполнено(ДатаПоследнейФиксации.ДатаСледующейФиксации) Тогда 
					Движение = Движения.уп_ДатаФиксацииОбязательствНПО.Добавить();
					Движение.НомерСчета = ТекСтрокаСписокСчетов.НомерСчета; 
					Движение.Период = Дата;
					Движение.ДатаНачалаПериодаФиксации = ДатаПоследнейФиксации.ДатаНачалаПериодаФиксации;  
					Движение.ДатаФиксации = ДатаПоследнейФиксации.ДатаФиксации;
					//дату следующей фиксации не устанавливаем
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Для Каждого ТекСтрокаСписокСчетов Из СписокСчетов Цикл
			//// регистр ПричиныЗакрытияПС 
			//ТекПричина = РегистрыСведений.уп_ПричиныЗакрытияПС.Получить(Новый Структура("НомерСчета", ТекСтрокаСписокСчетов.НомерСчета)).ПричинаЗакрытия;
			////если причина еще не прописана, то
			//Если НЕ (ЗначениеЗаполнено(ТекПричина)) Тогда
			Движение = Движения.уп_ПричиныЗакрытияПС.Добавить();
			Движение.Период = Дата;
			Движение.НомерСчета = ТекСтрокаСписокСчетов.НомерСчета;
			Движение.ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияПС.ПоСмерти;
			//КонецЕсли;
			//И причина в справочнике:
			ПС = ТекСтрокаСписокСчетов.НомерСчета.ПолучитьОбъект();
			ПС.ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияПС.ПоСмерти;
			ПС.Записать();
		КонецЦикла;
		
		Если ВозвратыОтвергнутыеПлатежи.Количество()>0 Тогда
			//списать остатки
			Таб = ВозвратыОтвергнутыеПлатежи.Выгрузить();
			Таб.Свернуть("ВидОстатка", "Сумма");
			Для Каждого стр из Таб Цикл
				Если стр.ВидОстатка = Перечисления.уп_ВидыОстатковПоСчету.ОстатокОтвергнутыйПлатежПенсии Тогда
					СписатьОтвергнутыйПлатежПенсии(Отказ);
				ИначеЕсли стр.ВидОстатка = Перечисления.уп_ВидыОстатковПоСчету.ОстатокОтвергнутыйПлатежРасторжение Тогда
					СписатьОтвергнутыйПлатежРасторжение(Отказ);
				ИначеЕсли стр.ВидОстатка = Перечисления.уп_ВидыОстатковПоСчету.ОстатокВозвратПенсии Тогда
					СписатьВозвратПенсии(Отказ);
				ИначеЕсли стр.ВидОстатка = Перечисления.уп_ВидыОстатковПоСчету.ОстатокВозвратРасторжение Тогда
					СписатьВозвратРасторжение(Отказ);
				ИначеЕсли стр.ВидОстатка = Перечисления.уп_ВидыОстатковПоСчету.ОстатокНачисленияПенсии Тогда
					СписатьНачислениеПенсии(Отказ);
				ИначеЕсли стр.ВидОстатка = Перечисления.уп_ВидыОстатковПоСчету.ОстатокНачисленияРасторжение Тогда
					СписатьНачислениеРасторжение(Отказ);
				КонецЕсли;	
			КонецЦикла;	
			Если Отказ Тогда
				Возврат;
			КонецЕсли;
			
			// еще надо закрыть резервы начислений
			ПроверитьСписатьРезервыНачислений();
			
			//зачислим в резерв возвраты и неуходы
			Для каждого стр из ВозвратыОтвергнутыеПлатежи Цикл
				Движение = Движения.уп_Резервы.ДобавитьПриход();
				Движение.Организация = Организация;
				Движение.Период = Дата;
				Если стр.СчетДоговора Тогда
					Движение.НомерСчета = стр.НомерСчета.Владелец.ПенсионныйСчет;
				Иначе
					Движение.НомерСчета = стр.НомерСчета;
				КонецЕсли;
				Движение.ТипРезерва = стр.ТипРезерва;
				Движение.ТипСуммы = стр.ТипСуммы;
				Движение.Сумма = стр.Сумма;
				Движение.Движение = Перечисления.уп_ВидыДвижений.ВозвратВРезерв;
				СтрокаТЧ = СписокСчетов.Найти(стр.НомерСчета,"НомерСчета");
				Если СтрокаТЧ<>Неопределено Тогда
					Движение.Схема = СтрокаТЧ.Схема;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	
	Если ДоступенПДС Тогда
		
		ДатаНачалаВеденияУчетаПоВидДоговора = Константы.уп_УчетРезерваПДСвРазрезеВидДоговора.Получить();
		Если ЗначениеЗаполнено(ДатаНачалаВеденияУчетаПоВидДоговора) И ДатаНачалаВеденияУчетаПоВидДоговора<=Дата Тогда
			ВестиУчетПоВидамДоговора = Истина;
		Иначе
			ВестиУчетПоВидамДоговора = Ложь;
		КонецЕсли;
		МоментЗакрытияДоговора = ПенсионныеПравила.ПорядокЗакрытияПоСмертиДоговоровПДС;
		
		Для Каждого ТекСтрокаСписокСчетов Из СписокСчетовПДС Цикл
			// регистр СостоянияПС 
			//если текущее состояние накопительный период, то подготовка к закрытию
			//если текущее состояние выплатной период, то выплаты приостановлены
			// в любом ином случае состояние менять не надо
			ТекСостояние = РегистрыСведений.пдс_СостоянияПенсионныхСчетовПДС.ПолучитьПоследнее(Дата,Новый Структура("НомерСчета", ТекСтрокаСписокСчетов.НомерСчета)).Состояние;
			ТекПенсия = РегистрыСведений.пдс_ПараметрыНазначенныхВыплатПДС.ПолучитьПоследнее(Дата,Новый Структура("НомерСчета", ТекСтрокаСписокСчетов.НомерСчета)).ТипПенсии;
			КорректироватьСостояние = Ложь;
			ДоговорЗакрыт = Ложь; 
			ПСЗакрыт = Ложь;
			АктуальноеСостояние = ПолучитьАктуальноеСостояниеПСПДС(Новый Структура("НомерСчета", ТекСтрокаСписокСчетов.НомерСчета));
			Если АктуальноеСостояние <> Неопределено Тогда
				Если (АктуальноеСостояние.Состояние <> Перечисления.пдс_СостоянияПСПДС.ПодготовкаКЗакрытию) 
					ИЛИ (АктуальноеСостояние.Состояние <> Перечисления.пдс_СостоянияПСПДС.Закрыт) Тогда
					Если АктуальноеСостояние.Период > Дата И АктуальноеСостояние.Регистратор.Дата < Дата Тогда
						КорректироватьСостояние = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			Если ТекСостояние = Перечисления.пдс_СостоянияПСПДС.НакопительныйПериод
				ИЛИ Тексостояние = Перечисления.пдс_СостоянияПСПДС.ВыплатнойПериод 
				ИЛИ Тексостояние = Перечисления.пдс_СостоянияПСПДС.НачисленияПриостановлены Тогда
				Движение = Движения.пдс_СостоянияПенсионныхСчетовПДС.Добавить();
				Движение.Период = Дата;
				Движение.НомерСчета = ТекСтрокаСписокСчетов.НомерСчета;
				Если (Тексостояние = Перечисления.пдс_СостоянияПСПДС.ВыплатнойПериод 
					ИЛИ Тексостояние = Перечисления.пдс_СостоянияПСПДС.НачисленияПриостановлены) 
					И ТекПенсия = Перечисления.уп_ТипыПенсионныхСхем.ПожизненныхВыплат Тогда
					Движение.Состояние = Перечисления.пдс_СостоянияПСПДС.Закрыт;
					ПСЗакрыт = Истина;
				Иначе
					Движение.Состояние = Перечисления.пдс_СостоянияПСПДС.ПодготовкаКЗакрытию;
				КонецЕсли;
				//если договор с физиком в свою пользу, то его надо закрыть
				Если ТекСтрокаСписокСчетов.НомерСчета.Владелец.Вкладчик = Участник Тогда
					Если МоментЗакрытияДоговора = 0 Тогда
						Движение = Движения.пдс_СостоянияДоговораПДС.Добавить();
						Движение.Период = Дата;
						Движение.Состояние = Перечисления.пдс_СостоянияДоговоровПДС.Закрыт;
						Движение.ДоговорПДС = ТекСтрокаСписокСчетов.НомерСчета.Владелец;
						
						ДоговорЗакрыт = Истина;
					КонецЕсли;
					
					Движение = Движения.пдс_ПричиныЗакрытияДоговораПДС.Добавить();
					Движение.Период = Дата;
					Движение.ДоговорПДС = ТекСтрокаСписокСчетов.НомерСчета.Владелец;
					Движение.ПричинаЗакрытия = Перечисления.пдс_ПричиныЗакрытияПСПДС.ПоСмерти;
					
				КонецЕсли;
				
				////Если КорректироватьСостояние Тогда
				////	Движение = Движения.пдс_СостоянияПенсионныхСчетовПДС.Добавить();
				////	Движение.Период = АктуальноеСостояние.Период+1;
				////	Движение.НомерСчета = ТекСтрокаСписокСчетов.НомерСчета;
				////	Движение.Состояние = Перечисления.пдс_СостоянияПСПДС.Закрыт;
				////КонецЕсли;
				
				Движение = Движения.пдс_ПричиныЗакрытияПенсионныхСчетовПДС.Добавить();
				Движение.Период = Дата;
				Движение.НомерСчета = ТекСтрокаСписокСчетов.НомерСчета;
				Движение.ПричинаЗакрытия = Перечисления.пдс_ПричиныЗакрытияПСПДС.ПоСмерти;
				
			КонецЕсли;
			Если ЗначениеЗаполнено(ДокументРегистрации) Тогда
				Если ТекСтрокаСписокСчетов.НомерСчета.Владелец.Вкладчик = Участник И МоментЗакрытияДоговора=0 
					и НЕ ДоговорЗакрыт  Тогда
					Движение = Движения.пдс_СостоянияДоговораПДС.Добавить();
					Движение.Период = Дата;
					Движение.Состояние = Перечисления.пдс_СостоянияДоговоровПДС.Закрыт;
					Движение.ДоговорПДС = ТекСтрокаСписокСчетов.НомерСчета.Владелец;
				КонецЕсли;	
			КонецЕсли;
			
			Если ПСЗакрыт Тогда
				ДатаПоследнейФиксации = РегистрыСведений.пдс_ДатыФиксацииОбязательствПДС.ПолучитьПоследнее(Дата-1, Новый Структура("НомерСчета", ТекСтрокаСписокСчетов.НомерСчета));
				Если ЗначениеЗаполнено(ДатаПоследнейФиксации.ДатаСледующейФиксации) Тогда 
					Движение = Движения.пдс_ДатыФиксацииОбязательствПДС.Добавить();
					Движение.НомерСчета = ТекСтрокаСписокСчетов.НомерСчета; 
					Движение.Период = Дата;
					Движение.ДатаНачалаПериодаФиксации = ДатаПоследнейФиксации.ДатаНачалаПериодаФиксации;  
					Движение.ДатаФиксации = ДатаПоследнейФиксации.ДатаФиксации;
					//дату следующей фиксации не устанавливаем
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если ВозвратыОтвергнутыеПлатежиПДС.Количество()>0 Тогда
			//списать остатки
			Таб = ВозвратыОтвергнутыеПлатежиПДС.Выгрузить();
			Таб.Свернуть("ВидОстатка", "Сумма");
			Для Каждого стр из Таб Цикл
				Если стр.ВидОстатка = Перечисления.уп_ВидыОстатковПоСчету.ОстатокОтвергнутыйПлатежПенсии Тогда
					СписатьОтвергнутыйПлатежПенсииПДС(Отказ);
				ИначеЕсли стр.ВидОстатка = Перечисления.уп_ВидыОстатковПоСчету.ОстатокОтвергнутыйПлатежРасторжение Тогда
					СписатьОтвергнутыйПлатежРасторжениеПДС(Отказ);
				ИначеЕсли стр.ВидОстатка = Перечисления.уп_ВидыОстатковПоСчету.ОстатокВозвратПенсии Тогда
					СписатьВозвратПенсииПДС(Отказ);
				ИначеЕсли стр.ВидОстатка = Перечисления.уп_ВидыОстатковПоСчету.ОстатокВозвратРасторжение Тогда
					СписатьВозвратРасторжениеПДС(Отказ);
				ИначеЕсли стр.ВидОстатка = Перечисления.уп_ВидыОстатковПоСчету.ОстатокНачисленияПенсии Тогда
					СписатьНачислениеПенсииПДС(Отказ);
				ИначеЕсли стр.ВидОстатка = Перечисления.уп_ВидыОстатковПоСчету.ОстатокНачисленияРасторжение Тогда
					СписатьНачислениеРасторжениеПДС(Отказ);
				КонецЕсли;	
			КонецЦикла;	
			Если Отказ Тогда
				Возврат;
			КонецЕсли;
			
			// еще надо закрыть резервы начислений
			ПроверитьСписатьРезервыНачисленийПДС();
			
			//зачислим в резерв возвраты и неуходы
			Для каждого стр из ВозвратыОтвергнутыеПлатежиПДС Цикл
				Если Стр.ТипРезерва = Перечисления.пдс_ТипыРезервовПДС.ИПС
					ИЛИ Стр.ТипРезерва = Перечисления.пдс_ТипыРезервовПДС.РезервСрочнойВыплаты Тогда
					ПараметрыДоговора = РегистрыСведений.пдс_ПараметрыДоговораПДС.ПолучитьПоследнее(Дата,Новый Структура("ДоговорПДС", ТекСтрокаСписокСчетов.НомерСчета.Владелец));
					Движение = Движения.пдс_РезервыПДС.ДобавитьПриход();
					Движение.Организация = Организация;
					Движение.Период = Дата;
					Движение.НомерСчета = стр.НомерСчета;
					Если ВестиУчетПоВидамДоговора Тогда
						Движение.РеглВидДоговора = ПараметрыДоговора.ВидДоговора.РегламентированныйВидДоговора;	
					КонецЕсли;
					Если стр.ТипРезерва = Перечисления.пдс_ТипыРезервовПДС.РезервСрочнойВыплаты Тогда 
						Движение.ТипРезерва = Перечисления.пдс_ТипыРезервовПДС.РезервУмершихРСВ;
					Иначе
						Движение.ТипРезерва = Перечисления.пдс_ТипыРезервовПДС.РезервУмершихИПС;
					КонецЕсли;
					Движение.ТипСуммы = стр.ТипСуммы;
					Движение.Сумма = стр.Сумма;
					Движение.Движение = Перечисления.уп_ВидыДвижений.ВозвратВРезерв;
					Движение.ВидДоговора = ПараметрыДоговора.ВидДоговора;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		
		//Движения.пдс_ДатыФиксацииОбязательствПДС.Записать();
		Движения.пдс_СостоянияПенсионныхСчетовПДС.Записать();
		Движения.пдс_СостоянияДоговораПДС.Записать();
		Движения.пдс_ПричиныЗакрытияПенсионныхСчетовПДС.Записать();
		
		Движения.пдс_ВозвратыПенсийПДС.Записать();
		Движения.пдс_ВозвратыПрочихНачисленийПДС.Записать();
		Движения.пдс_ОтвергнутыеПлатежиПенсийПДС.Записать();
		Движения.пдс_ОтвергнутыеПлатежиПрочиеНачисленияПДС.Записать();
		Движения.пдс_НачисленияПенсийПДС.Записать();
		Движения.пдс_ПрочиеНачисленияПДС.Записать();
		Движения.пдс_РезервыПДС.Записать();
	КонецЕсли;		

	
	ДополнительныеСвойства.Вставить("МассивСообщений", МассивСообщений);
КонецПроцедуры
